In [136]:
import numpy as np
import pandas as pd

In [137]:
list1=[2,3,4,1,5]
s1=pd.Series(list1,index=['a','b','c','d','e']) #index 이름 지정
print(s1)
print(type(s1))
print(s1.dtype)
print(s1.values)
print(s1.index)

a    2
b    3
c    4
d    1
e    5
dtype: int64
<class 'pandas.core.series.Series'>
int64
[2 3 4 1 5]
Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [138]:
s2=pd.Series(list1) #index가 숫자일 경우
print(s2)
print(s2.index)

0    2
1    3
2    4
3    1
4    5
dtype: int64
RangeIndex(start=0, stop=5, step=1)

In [139]:
sdata={"kim":85,"lee":75,"choi":65}
s3=pd.Series(sdata) #dictionary를 이용한 Series 생성
print(s3)

kim     85
lee     75
choi    65
dtype: int64

In [140]:
#DataFrame 생성
#형식 : pd.DataFrame(data,columns=[],index=[])
data={"names":['민준','현우','서연','동현','지현'],
      "years":[2013,2014,2045,2016,2015],
      "points":[1.5,1.7,3.6,2.4,2.9]
    }
df=pd.DataFrame(data)
df

  names  years  points
0    민준   2013     1.5
1    현우   2014     1.7
2    서연   2045     3.6
3    동현   2016     2.4
4    지현   2015     2.9

In [141]:
#DataFrame 생성2
names=['민준','현우','서연','동현','지현']
years=[2013,2014,2045,2016,2015]
points=[1.5,1.7,3.6,2.4,2.9]

data=[names,years,points]
df1=pd.DataFrame(data).T #.T : 행과 열을 바꿈
df1.columns=['names','years','points'];df1 #두 줄의 명령을 한 줄로 쓰기 (;)

  names years points
0    민준  2013    1.5
1    현우  2014    1.7
2    서연  2045    3.6
3    동현  2016    2.4
4    지현  2015    2.9

In [142]:
#numpy array를 이용한 DataFrame 생성
arr=np.array(data).T 
arr
df2=pd.DataFrame(arr,columns=['names','years','points'], index=['one','two','three','four','five']);df2

      names years points
one      민준  2013    1.5
two      현우  2014    1.7
three    서연  2045    3.6
four     동현  2016    2.4
five     지현  2015    2.9

In [143]:
print(df2) 
print(df2.index) 
print(df2.columns) 
print(df2.values) #2차원 배열로 출력

      names years points
one      민준  2013    1.5
two      현우  2014    1.7
three    서연  2045    3.6
four     동현  2016    2.4
five     지현  2015    2.9
Index(['one', 'two', 'three', 'four', 'five'], dtype='object')
Index(['names', 'years', 'points'], dtype='object')
[['민준' '2013' '1.5']
 ['현우' '2014' '1.7']
 ['서연' '2045' '3.6']
 ['동현' '2016' '2.4']
 ['지현' '2015' '2.9']]

In [144]:
names=df2['names']
years=df2['years']
points=df2['points']
print(names)
print(type(years))
print(points)

one      민준
two      현우
three    서연
four     동현
five     지현
Name: names, dtype: object
<class 'pandas.core.series.Series'>
one      1.5
two      1.7
three    3.6
four     2.4
five     2.9
Name: points, dtype: object

In [145]:
print(df2.shape) #DataFrame의 크기 : 5행 3열

(5, 3)

In [146]:
df2.info() #DataFrame의 기본 정보 출력

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, one to five
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   names   5 non-null      object
 1   years   5 non-null      object
 2   points  5 non-null      object
dtypes: object(3)
memory usage: 160.0+ bytes

In [147]:
#파일->데이터프레임으로 읽어오기
chocolate_df=pd.read_csv("data/chocolate_rating.csv",header=None) 

chocolate_df.columns=['id','year','kakao','avg']

#데이터프레임 -> 파일로 저장하기
chocolate_df.to_csv("data/chocol.csv",index=False)

In [148]:
character_df=pd.read_excel("data/characters.xlsx")
print(character_df)
character_df.to_excel("data/char.xlsx",index=False) #index를 제외하고 저장

   ID   이름  상징색    취미    특징
0   1  뽀로로  파랑색    낚시    펭귄
1   2   에디  주황색  과학실험  사막여우
2   3   크롱  초록색   눈싸움    공룡
3   4   루피  분홍색    요리    비버
4   5   패티  보라색    운동    펭귄

In [149]:
df2

      names years points
one      민준  2013    1.5
two      현우  2014    1.7
three    서연  2045    3.6
four     동현  2016    2.4
five     지현  2015    2.9

In [150]:
chocolate_df

        id  year  kakao   avg
0        1  2016   0.63  3.75
1        2  2015   0.70  2.75
2        3  2015   0.70  3.00
3        4  2015   0.70  3.50
4        5  2015   0.70  3.50
...    ...   ...    ...   ...
1790  1791  2011   0.70  3.75
1791  1792  2011   0.65  3.00
1792  1793  2011   0.65  3.50
1793  1794  2011   0.62  3.25
1794  1795  2010   0.65  3.00

[1795 rows x 4 columns]

In [151]:
character_df

   ID   이름  상징색    취미    특징
0   1  뽀로로  파랑색    낚시    펭귄
1   2   에디  주황색  과학실험  사막여우
2   3   크롱  초록색   눈싸움    공룡
3   4   루피  분홍색    요리    비버
4   5   패티  보라색    운동    펭귄

In [152]:
#현재 데이터프레임의 정보 (행,열,데이터타입 등) 확인
#df2.info()
#chocolate_df.info()
character_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      5 non-null      int64
 1   이름      5 non-null      object
 2   상징색     5 non-null      object
 3   취미      5 non-null      object
 4   특징      5 non-null      object
dtypes: int64(1), object(4)
memory usage: 332.0+ bytes

In [153]:
#데이터프레임의 정보 columns 이름 바꾸기

chocolate_df.columns=['번호','연도','함유량','평점']
#chocolate_df 
#필드명이 변경됨

#데이터프레임의 정보 확인 (주석처리해서 확인하세요)
chocolate_df.head() #앞의 5개의 데이터만 출력
chocolate_df.tail() #뒤의 5개의 데이터만 출력
chocolate_df[:10] #앞의 10개의 데이터만 출력
chocolate_df[10:20] #11~20번째 데이터만 출력 - 슬라이싱은 행부분만 나눠서 확인 가능

    번호    연도  함유량    평점
10  11  2013  0.7  2.75
11  12  2013  0.7  3.00
12  13  2013  0.7  3.25
13  14  2013  0.7  3.75
14  15  2013  0.7  2.75
15  16  2013  0.7  3.00
16  17  2013  0.7  3.25
17  18  2013  0.7  4.00
18  19  2013  0.7  3.25
19  20  2013  0.7  3.50

In [154]:
chocolate_df.describe() #기초통계량 확인 - 숫자로 되어있는 값들을 자동으로 연산해줌
# count : 데이터의 개수
# mean : 평균
# std : 표준편차
# min : 최소값
# 25% : 1사분위수
# 50% : 중앙값

                번호           연도          함유량           평점
count  1795.000000  1795.000000  1795.000000  1795.000000
mean    898.000000  2012.325348     0.717003     3.185933
std     518.316184     2.927210     0.063230     0.478062
min       1.000000  2006.000000     0.420000     1.000000
25%     449.500000  2010.000000     0.700000     2.875000
50%     898.000000  2013.000000     0.700000     3.250000
75%    1346.500000  2015.000000     0.750000     3.500000
max    1795.000000  2017.000000     1.000000     5.000000

In [155]:
df2.describe() #모든 필드가 문자(object)로 되어있으면 object형식에 맞춰 정보를 출력
#df2.info() 
#count : 데이터의 개수
#unique : 중복되지 않은 데이터의 개수
#top : 가장 많이 나온 데이터
#freq : top
df2

      names years points
one      민준  2013    1.5
two      현우  2014    1.7
three    서연  2045    3.6
four     동현  2016    2.4
five     지현  2015    2.9

In [156]:
character_df.describe()

             ID
count  5.000000
mean   3.000000
std    1.581139
min    1.000000
25%    2.000000
50%    3.000000
75%    4.000000
max    5.000000

In [157]:
#필드의 데이터타입을 변경 (astype : 데이터타입 변경)
df2['years']=df2['years'].astype(np.int64) #years필드의 데이터타입을 int64로 변경 
df2['points']=df2['points'].astype(np.float64) #points필드의 데이터타입을 float64로 변경
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, one to five
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   names   5 non-null      object
 1   years   5 non-null      int64
 2   points  5 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 160.0+ bytes

In [158]:
df2.describe()

             years    points
count     5.000000  5.000000
mean   2020.600000  2.420000
std      13.685759  0.864292
min    2013.000000  1.500000
25%    2014.000000  1.700000
50%    2015.000000  2.400000
75%    2016.000000  2.900000
max    2045.000000  3.600000

In [159]:
#인덱스 기준 정렬
#ascending : True(오름차순), False(내림차순)
df2.sort_index(axis=0, ascending=True) #행을 기준으로 알파벳 오름차순 정렬
df2.sort_index(axis=0, ascending=False) #행을 기준으로 알파벳 내림차순 정렬

      names  years  points
two      현우   2014     1.7
three    서연   2045     3.6
one      민준   2013     1.5
four     동현   2016     2.4
five     지현   2015     2.9

In [160]:
#열기준 정렬
df2.sort_values(by=['names'],ascending=True) #names열을 기준으로 가나다 오름차순 정렬
df2.sort_values(by=['years','points'],ascending=False) #years를 기준으로 내림차순 정렬 후 points를 기준으로 내림차순 정렬

      names  years  points
three    서연   2045     3.6
four     동현   2016     2.4
five     지현   2015     2.9
two      현우   2014     1.7
one      민준   2013     1.5

In [161]:
df2[['names','points']] #2개 이상의 열을 선택할 때는 리스트로 묶어서 선택 ([])

      names  points
one      민준     1.5
two      현우     1.7
three    서연     3.6
four     동현     2.4
five     지현     2.9

In [162]:
df2['names']
df2.names #위와 동일한 결과 (한 개의 필드일 경우)

one      민준
two      현우
three    서연
four     동현
five     지현
Name: names, dtype: object

In [163]:
df2.iloc[::2,0:2] #0부터 끝까지 2칸씩 건너뛰어서 출력

      names  years
one      민준   2013
three    서연   2045
five     지현   2015

In [164]:
df2

      names  years  points
one      민준   2013     1.5
two      현우   2014     1.7
three    서연   2045     3.6
four     동현   2016     2.4
five     지현   2015     2.9

In [165]:
df2.loc[['one','three'],['names','points']] #one과 three행의 names와 points 필드 출력

      names  points
one      민준     1.5
three    서연     3.6

In [166]:
df2.loc[df2['years']==2014] #years가 2014인 데이터 출력

    names  years  points
two    현우   2014     1.7

In [167]:
print(df2.loc[df2['years']==2014]) #years가 2014인 데이터 출력
print(df2.loc[df2['points']>2.0]) #points가 2.0보다 큰 데이터 출력

    names  years  points
two    현우   2014     1.7
      names  years  points
three    서연   2045     3.6
four     동현   2016     2.4
five     지현   2015     2.9

In [168]:
chocolate_df.loc[chocolate_df['평점']==5,['번호','평점']]

    번호   평점
78  79  5.0
86  87  5.0

In [169]:
#데이터 조회

#isin(): 데이터프레임의 필드에 해당 값이 있는지 확인
df1[df1['names'].isin(['민준','현우'])]
df1[df1.names.isin(['민준','현우'])]

#조건을 만족하는 데이터 조회
df1[df1.points>2]

#두 조건식 모두 만족(&)하는 데이터 조회
df1[(df1.years=='2015')&(df1.points>2)]
df1.years=df1.years.astype('Int64')
df1[(df1.years==2015)&(df1.points>2)]

#두 조건식 중 하나라도 만족(|)하는 데이터 조회
df1[(df1.years==2014)|(df1.points>2)]

#특정 문자열이 포함된 데이터 조회
df1[df1.names.str.contains('현')] #현이라는 글자가 들어간 데이터 조회

  names  years points
1    현우   2014    1.7
3    동현   2016    2.4
4    지현   2015    2.9

In [170]:
df2['points2']=df2.points+0.5;df2 #points2 새로운 필드 추가
#df2.points3=df2.points*0.5;df2 - 새로운 필드생성은 (.)불가 / 대괄호안에 써야 생성가능

      names  years  points  points2
one      민준   2013     1.5      2.0
two      현우   2014     1.7      2.2
three    서연   2045     3.6      4.1
four     동현   2016     2.4      2.9
five     지현   2015     2.9      3.4

In [171]:
#데이터 수정

df2.loc['one','points2']=df2.loc['one','points']+1;df2 #one행의 points2를 1증가

      names  years  points  points2
one      민준   2013     1.5      2.5
two      현우   2014     1.7      2.2
three    서연   2045     3.6      4.1
four     동현   2016     2.4      2.9
five     지현   2015     2.9      3.4

In [172]:
df2.loc['two':'three','points2']=[0]*2;df2 #two부터 three까지 points2를 0으로 변경

      names  years  points  points2
one      민준   2013     1.5      2.5
two      현우   2014     1.7      0.0
three    서연   2045     3.6      0.0
four     동현   2016     2.4      2.9
five     지현   2015     2.9      3.4

In [173]:
df2['aaa']=[1]*5;df2 #새로운 필드 aaa를 추가하고 1로 초기화
df2['aaa1']=[1,1,1,1,1];df2 #위와 동일한 결과

      names  years  points  points2  aaa  aaa1
one      민준   2013     1.5      2.5    1     1
two      현우   2014     1.7      0.0    1     1
three    서연   2045     3.6      0.0    1     1
four     동현   2016     2.4      2.9    1     1
five     지현   2015     2.9      3.4    1     1

In [174]:
df2['bbb']=[2,3,3,4,5];df2 #새로운 필드 bbb를 추가하고 값 할당

      names  years  points  points2  aaa  aaa1  bbb
one      민준   2013     1.5      2.5    1     1    2
two      현우   2014     1.7      0.0    1     1    3
three    서연   2045     3.6      0.0    1     1    3
four     동현   2016     2.4      2.9    1     1    4
five     지현   2015     2.9      3.4    1     1    5

In [175]:
df11=df1.set_index('names');df11 #names를 인덱스로 설정

       years points
names
민준      2013    1.5
현우      2014    1.7
서연      2045    3.6
동현      2016    2.4
지현      2015    2.9

In [176]:
df1.set_index('names',inplace=True) #names를 인덱스로 설정하고 원본에 적용 / inplace : 원본에 적용
df1

       years points
names
민준      2013    1.5
현우      2014    1.7
서연      2045    3.6
동현      2016    2.4
지현      2015    2.9

In [177]:
# df1.reset_index(inplace=True);df1 #points를 인덱스에서 해제하고 원본에 적용
# df1.set_index('points',inplace=True);df1 #point를 인덱스로 설정하고 원본에 적용
#  df1.reset_index(inplace=True);df1 #point를 인덱스에서 해제하고 원본에 적용

In [178]:
# df1.drop('level_0',axis=1,inplace=True);df1 #level_0 필드 삭제
# df1.drop('index',axis=1,inplace=True);df1 #index 필드 삭제
df1

       years points
names
민준      2013    1.5
현우      2014    1.7
서연      2045    3.6
동현      2016    2.4
지현      2015    2.9

In [179]:
df['gender']=['남자','남자','여자','남자','여자'];df

  names  years  points gender
0    민준   2013     1.5     남자
1    현우   2014     1.7     남자
2    서연   2045     3.6     여자
3    동현   2016     2.4     남자
4    지현   2015     2.9     여자

In [180]:
reo_cond={'gender':{'남자':1,'여자':2}}
df=df.replace(reo_cond);df

C:\Users\it\AppData\Local\Temp\ipykernel_12936\2063020009.py:2: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df=df.replace(reo_cond);df

  names  years  points  gender
0    민준   2013     1.5       1
1    현우   2014     1.7       1
2    서연   2045     3.6       2
3    동현   2016     2.4       1
4    지현   2015     2.9       2

In [ ]:
#dataFrame 생성
name=['kim','lee','choi','park','jung']
year=[1,2,1,2,1]
kor=[85,95,75,70,80]
eng=[82,90,75,71,80]
math=[85,91,72,75,80]
data=[name,year,kor,eng,math]
arr=np.array(data).T #.T : 행과 열을 바꿈

data_df=pd.DataFrame(arr,columns=['name','year','kor','eng','math'])
data_df

   name year kor eng math
0   kim    1  85  82   85
1   lee    2  95  90   91
2  choi    1  75  75   72
3  park    2  70  71   75
4  jung    1  80  80   80

In [182]:
data_df['total']=data_df.kor+data_df.eng+data_df.math;data_df #total 필드 추가

   name year kor eng math   total
0   kim    1  85  82   85  858285
1   lee    2  95  90   91  959091
2  choi    1  75  75   72  757572
3  park    2  70  71   75  707175
4  jung    1  80  80   80  808080

In [183]:
data_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   year    5 non-null      object
 2   kor     5 non-null      object
 3   eng     5 non-null      object
 4   math    5 non-null      object
 5   total   5 non-null      object
dtypes: object(6)
memory usage: 372.0+ bytes

In [ ]:
#데이터형 변환 
data_df['kor']=data_df['kor'].astype('Int64')
data_df['eng']=data_df.eng.astype('Int64') #동일한 결과 표현법
data_df['math']=data_df['math'].astype('Int64')
data_df['year']=data_df['year'].astype('Int64')
data_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   year    5 non-null      Int64
 2   kor     5 non-null      Int64
 3   eng     5 non-null      Int64
 4   math    5 non-null      Int64
 5   total   5 non-null      object
dtypes: Int64(4), object(2)
memory usage: 392.0+ bytes

In [190]:
data_df.total=data_df.kor+data_df.eng+data_df.math;data_df #total 필드 재계산

   name  year  kor  eng  math  total
0   kim     1   85   82    85    252
1   lee     2   95   90    91    276
2  choi     1   75   75    72    222
3  park     2   70   71    75    216
4  jung     1   80   80    80    240

In [191]:
data_df['avg']=data_df.total/3;data_df #avg 필드 추가

   name  year  kor  eng  math  total   avg
0   kim     1   85   82    85    252  84.0
1   lee     2   95   90    91    276  92.0
2  choi     1   75   75    72    222  74.0
3  park     2   70   71    75    216  72.0
4  jung     1   80   80    80    240  80.0

In [192]:
data_df.year.value_counts() #year 필드의 데이터별 개수

year
1    3
2    2
Name: count, dtype: Int64

In [193]:
chocolate_df['평점'].value_counts() #평점 필드의 데이터별 개수

평점
3.50    392
3.00    341
3.25    303
2.75    259
3.75    210
2.50    127
4.00     98
2.00     32
2.25     14
1.50     10
1.00      4
1.75      3
5.00      2
Name: count, dtype: int64

In [194]:
chocolate_df['함유량'].value_counts() #함유량 필드의 데이터별 개수

함유량
0.70    672
0.75    222
0.72    189
0.65     78
0.80     72
0.74     52
0.68     47
0.73     44
0.60     43
0.85     36
0.64     34
0.77     33
0.71     31
0.67     27
0.66     23
0.76     23
1.00     20
0.82     17
0.78     17
0.55     16
0.62     14
0.63     12
0.69     10
0.61      9
0.90      8
0.88      8
0.58      8
0.81      5
0.83      4
0.84      4
0.91      3
0.99      2
0.89      2
0.56      2
0.46      1
0.53      1
0.79      1
0.57      1
0.86      1
0.50      1
0.42      1
0.87      1
Name: count, dtype: int64

In [196]:
data_df

   name  year  kor  eng  math  total   avg
0   kim     1   85   82    85    252  84.0
1   lee     2   95   90    91    276  92.0
2  choi     1   75   75    72    222  74.0
3  park     2   70   71    75    216  72.0
4  jung     1   80   80    80    240  80.0

In [ ]:
#year별 total합계
data_df.groupby('year')['total'].sum()

year
1    714
2    492
Name: total, dtype: Int64

In [ ]:
#year별 kor,eng,math합계 / 여러개 일땐([])를 감싸줘야함.
data_df.groupby('year')[['kor','eng','math']].sum()

      kor  eng  math
year
1     240  237   237
2     165  161   166

In [ ]:
#year별 kor,eng,math평균
data_df.groupby('year')[['kor','eng','math']].mean()

       kor   eng  math
year
1     80.0  79.0  79.0
2     82.5  80.5  83.0

In [200]:
#year별 total합계,평균,중앙값,개수
data_df.groupby('year')['total'].agg(['sum','mean','median','count'])

      sum   mean  median  count
year
1     714  238.0   240.0      3
2     492  246.0   246.0      2

In [ ]:
#agg()함수를 이용하여 필드마다 여러개의 함수 적용
# year별 kor합계, avg평균, total중앙값, eng개수
aggs={'kor':'sum','avg':'mean','total':'median','eng':'count'} 
data_df.groupby('year').agg(aggs)

      kor        avg  total  eng
year
1     240  79.333333  240.0    3
2     165       82.0  246.0    2

In [215]:
df2

      names  years  points  points2  aaa  aaa1  bbb
one      민준   2013     1.5      2.5    1     1    2
two      현우   2014     1.7      0.0    1     1    3
three    서연   2045     3.6      0.0    1     1    3
four     동현   2016     2.4      2.9    1     1    4
five     지현   2015     2.9      3.4    1     1    5

# 문제

In [212]:
# 1) df2를 사용하여 연도별 points의 합과, 평균을 구하라.
df2.groupby('years')['points'].agg(['sum','mean'])

       sum  mean
years
2013   1.5   1.5
2014   1.7   1.7
2015   2.9   2.9
2016   2.4   2.4
2045   3.6   3.6

In [213]:
# 2) 연도별 points와 point2의 평균을 구하라.
df2.groupby('years')[['points','points2']].mean()

       points  points2
years
2013      1.5      2.5
2014      1.7      0.0
2015      2.9      3.4
2016      2.4      2.9
2045      3.6      0.0

In [214]:
# 3) 연도별 points의 중앙값, points2의 갯수를 구하라.
df2.groupby('years').agg({'points':'median','points2':'count'})

       points  points2
years
2013      1.5        1
2014      1.7        1
2015      2.9        1
2016      2.4        1
2045      3.6        1

# JOIN

In [219]:
df20=df2[['names','years','points']]
df21=df2[['names','points2']]

In [ ]:
df20.set_index('names',inplace=True)

In [228]:
df20

       years  points
names
민준      2013     1.5
현우      2014     1.7
서연      2045     3.6
동현      2016     2.4
지현      2015     2.9

In [224]:
df21.set_index('names',inplace=True);df21

       points2
names
민준         2.5
현우         0.0
서연         0.0
동현         2.9
지현         3.4

In [ ]:
#names(index)를 기준으로 병합
join_df1=df20.merge(df21,left_index=True, right_index=True);join_df1

       years  points  points2
names
민준      2013     1.5      2.5
현우      2014     1.7      0.0
서연      2045     3.6      0.0
동현      2016     2.4      2.9
지현      2015     2.9      3.4

In [232]:
con_df1=df2[:3]
con_df2=df2[3:]
con_df2

     names  years  points  points2  aaa  aaa1  bbb
four    동현   2016     2.4      2.9    1     1    4
five    지현   2015     2.9      3.4    1     1    5

In [ ]:
con=pd.concat([con_df1,con_df2],axis=0);con #axix=0 : 행으로 병합

      names  years  points  points2  aaa  aaa1  bbb
one      민준   2013     1.5      2.5    1     1    2
two      현우   2014     1.7      0.0    1     1    3
three    서연   2045     3.6      0.0    1     1    3
four     동현   2016     2.4      2.9    1     1    4
five     지현   2015     2.9      3.4    1     1    5

In [236]:
con2=pd.concat([df20,df21],axis=1);con2 #axix=1 : 열로 병합

       years  points  points2
names
민준      2013     1.5      2.5
현우      2014     1.7      0.0
서연      2045     3.6      0.0
동현      2016     2.4      2.9
지현      2015     2.9      3.4

In [241]:
con2=pd.concat([df,df1],axis=1);con2

   names   years points  gender  years points
0     민준  2013.0    1.5     1.0   <NA>    NaN
1     현우  2014.0    1.7     1.0   <NA>    NaN
2     서연  2045.0    3.6     2.0   <NA>    NaN
3     동현  2016.0    2.4     1.0   <NA>    NaN
4     지현  2015.0    2.9     2.0   <NA>    NaN
민준   NaN     NaN    NaN     NaN   2013    1.5
현우   NaN     NaN    NaN     NaN   2014    1.7
서연   NaN     NaN    NaN     NaN   2045    3.6
동현   NaN     NaN    NaN     NaN   2016    2.4
지현   NaN     NaN    NaN     NaN   2015    2.9